app/controllers/dashboard/trainer_controller.rb

SELECT  "cards".* FROM "cards" WHERE "cards"."block_id" = $1 AND (review_date <= '2015-05-17 09:47:25.902802')  ORDER BY RANDOM() LIMIT 1  [["block_id", 57]]
---
  def index
    @card = if current_user.current_block
              current_user.current_block.cards.pending.first || current_user.current_block.cards.repeating.first

SELECT  "cards".* FROM "cards" WHERE "cards"."user_id" = $1 AND "cards"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 1]]
---
  def review_card
    @card = current_user.cards.find(params[:card_id])